pimple/axisSymm/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 0.001;
l 550; // [mm] lenght of cone
R 5; // [mm] biggest radiuse of cone
h #eval{0.0001 * $l}; // size of cell

 
vertices
(
(0 0 0) // 0
(#eval{sqrt($R * $R - ($h/2) * ($h/2))} #eval{$h/2} 0) // 1
(#eval{sqrt($R * $R - ($h/2) * ($h/2))} #eval{($R / $R) * $h/2} $l) // 2
(0 0 $l) // 3
(#eval{sqrt($R * $R - ($h/2) * ($h/2))} #eval{-$h/2} 0) // 4
(#eval{sqrt($R * $R - ($h/2) * ($h/2))} #eval{-(($R / $R) * $h/2)} $l) // 5
);
 
blocks
(
hex (0 4 1 0 3 5 2 3) (10 1 1100) simpleGrading (1 1 1)
);
 
edges
(
arc 4 1 ($R 0 0)
arc 2 5 ($R 0 $l)
);
 
boundary
(
     front
     { 
           type wedge;
           faces  
           (
               (0 1 2 3)
           );
      }
     back
     { 
           type wedge;
           faces  
           (
               (0 3 5 4)
           );
      }
     pipe
     { 
           type wall;
           faces  
           (
               (1 4 5 2)
           );
      }
     inlet
     { 
           type patch;
           faces  
           (
               (0 4 1 0)
           );
      }
     outlet
     { 
           type patch;
           faces  
           (
               (3 5 2 3)
           );
      }
     axis
     { 
           type empty;
           faces  
           (
               (0 3 3 0)
           );
      }
);
 
mergePatchPairs
(
);