pimple/axisSymm/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.011000000000000003;

deltaT          0.0001;

writeControl    adjustable;

writeInterval   0.01;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           5;

functions
{
    flowType1
    {
        // Mandatory entries (unmodifiable)
        type            fluxSummary;
        libs            (fieldFunctionObjects);

        // Optional entries (runtime modifiable)
        rho             none;
        field           U;
        mode            faceZoneAndDirection;

        faceZoneAndDirection
        (
            (outputFace (0 0 1))
        );
    }
    probes
    {
        type probes;
        libs ("libsampling.so");
        writeInterval 1; // записывать на каждом временном шаге

        probeLocations
        (
            (0 0 0.05) // точка на входе
            (0 0 0.55) // точка на выходе
        );
        fields (p);
    }
}
// ************************************************************************* //
